IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_dcsm_z1_regs.xml
<module id="DCSM_Z1_REGS" HW_revision="" description="DCSM Z1 Registers">
	<register id="Z1_LINKPOINTER" width="32" page="1" offset="0x0" internal="0" description="Zone 1 Link Pointer">
		<bitfield id="LINKPOINTER" description="Zone1 LINK Pointer" begin="13" end="0" width="14" rwaccess="R"/>
	</register>
	<register id="Z1_OTPSECLOCK" width="32" page="1" offset="0x2" internal="0" description="Zone 1 OTP Secure Lock">
		<bitfield id="JTAGLOCK" description="JTAG Lock Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PSWDLOCK" description="Zone1 Password Lock." begin="7" end="4" width="4" rwaccess="R"/>
		<bitfield id="CRCLOCK" description="Zone1 CRC Lock." begin="11" end="8" width="4" rwaccess="R"/>
	</register>
	<register id="Z1_JLM_ENABLE" width="32" page="1" offset="0x4" internal="0" description="Zone 1 JTAGLOCK Enable Register">
		<bitfield id="Z1_JLM_ENABLE" description="Zone1 JLM_ENABLE register." begin="3" end="0" width="4" rwaccess="R"/>
	</register>
	<register id="Z1_LINKPOINTERERR" width="32" page="1" offset="0x6" internal="0" description="Link Pointer Error">
		<bitfield id="Z1_LINKPOINTERERR" description="Error to Resolve Z1 Link pointer from OTP loaded values" begin="13" end="0" width="14" rwaccess="R"/>
	</register>
	<register id="Z1_GPREG1" width="32" page="1" offset="0x8" internal="0" description="Zone 1 General Purpose Register-1">
		<bitfield id="GPREG1" description="General Purpose Register-1" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_GPREG2" width="32" page="1" offset="0xa" internal="0" description="Zone 1 General Purpose Register-2">
		<bitfield id="GPREG2" description="General Purpose Register-2" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_GPREG3" width="32" page="1" offset="0xc" internal="0" description="Zone 1 General Purpose Register-3">
		<bitfield id="GPREG3" description="General Purpose Register-3" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_GPREG4" width="32" page="1" offset="0xe" internal="0" description="Zone 1 General Purpose Register-4">
		<bitfield id="GPREG4" description="General Purpose Register-4" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CSMKEY0" width="32" page="1" offset="0x10" internal="0" description="Zone 1 CSM Key 0">
		<bitfield id="Z1_CSMKEY0" description="Word0 to unlock Zone1, should match  Z1_CSMPSWD0." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z1_CSMKEY1" width="32" page="1" offset="0x12" internal="0" description="Zone 1 CSM Key 1">
		<bitfield id="Z1_CSMKEY1" description="Word1 to unlock Zone1, should match Z1_CSMPSWD1" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z1_CSMKEY2" width="32" page="1" offset="0x14" internal="0" description="Zone 1 CSM Key 2">
		<bitfield id="Z1_CSMKEY2" description="Word2 to unlock Zone1, should match Z1_CSMPSWD2" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z1_CSMKEY3" width="32" page="1" offset="0x16" internal="0" description="Zone 1 CSM Key 3">
		<bitfield id="Z1_CSMKEY3" description="Word3 to unlock Zone1, should match Z1_CSMPSWD3" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z1_CR" width="32" page="1" offset="0x18" internal="0" description="Zone 1 CSM Control Register">
		<bitfield id="ALLZERO" description="CSMPSWD All Zeros" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="ALLONE" description="CSMPSWD All Ones" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="UNSECURE" description="CSMPSWD Match CSMKEY" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="ARMED" description="CSM Passwords Read Status" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="FORCESEC" description="Force Secure" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="Z1_GRABSECT1R" width="32" page="1" offset="0x1a" internal="0" description="Zone 1 Grab Flash Status Register 1">
		<bitfield id="GRAB_SECT0" description="Grab Flash Sector 0 in Bank 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT1" description="Grab Flash Sector 1 in Bank 0" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT2" description="Grab Flash Sector 2 in Bank 0" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT3" description="Grab Flash Sector 3 in Bank 0" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT4" description="Grab Flash Sector 4 in Bank 0" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT5" description="Grab Flash Sector 5 in Bank 0" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT6" description="Grab Flash Sector 6 in Bank 0" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT7" description="Grab Flash Sector 7 in Bank 0" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT8" description="Grab Flash Sector 8 in Bank 0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT9" description="Grab Flash Sector 9 in Bank 0" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT10" description="Grab Flash Sector 10 in Bank 0" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT11" description="Grab Flash Sector 11 in Bank 0" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT12" description="Grab Flash Sector 12 in Bank 0" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT13" description="Grab Flash Sector 13 in Bank 0" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT14" description="Grab Flash Sector 14 in Bank 0" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT15" description="Grab Flash Sector 15 in Bank 0" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_GRABSECT2R" width="32" page="1" offset="0x1c" internal="0" description="Zone 1 Grab Flash Status Register 2">
		<bitfield id="GRAB_SECT0" description="Grab Flash Sector 0 in Bank 1" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT1" description="Grab Flash Sector 1 in Bank 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT2" description="Grab Flash Sector 2 in Bank 1" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT3" description="Grab Flash Sector 3 in Bank 1" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT4" description="Grab Flash Sector 4 in Bank 1" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT5" description="Grab Flash Sector 5 in Bank 1" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT6" description="Grab Flash Sector 6 in Bank 1" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT7" description="Grab Flash Sector 7 in Bank 1" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT8" description="Grab Flash Sector 8 in Bank 1" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT9" description="Grab Flash Sector 9 in Bank 1" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT10" description="Grab Flash Sector 10 in Bank 1" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT11" description="Grab Flash Sector 11 in Bank 1" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT12" description="Grab Flash Sector 12 in Bank 1" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT13" description="Grab Flash Sector 13 in Bank 1" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT14" description="Grab Flash Sector 14 in Bank 1" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT15" description="Grab Flash Sector 15 in Bank 1" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_GRABSECT3R" width="32" page="1" offset="0x1e" internal="0" description="Zone 1 Grab Flash Status Register 3">
		<bitfield id="GRAB_SECT0" description="Grab Flash Sector 0 in Bank 2" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT1" description="Grab Flash Sector 1 in Bank 2" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT2" description="Grab Flash Sector 2 in Bank 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT3" description="Grab Flash Sector 3 in Bank 2" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT4" description="Grab Flash Sector 4 in Bank 2" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT5" description="Grab Flash Sector 5 in Bank 2" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT6" description="Grab Flash Sector 6 in Bank 2" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT7" description="Grab Flash Sector 7 in Bank 2" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT8" description="Grab Flash Sector 8 in Bank 2" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT9" description="Grab Flash Sector 9 in Bank 2" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT10" description="Grab Flash Sector 10 in Bank 2" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT11" description="Grab Flash Sector 11 in Bank 2" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT12" description="Grab Flash Sector 12 in Bank 2" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT13" description="Grab Flash Sector 13 in Bank 2" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT14" description="Grab Flash Sector 14 in Bank 2" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT15" description="Grab Flash Sector 15 in Bank 2" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_GRABRAM1R" width="32" page="1" offset="0x20" internal="0" description="Zone 1 Grab RAM Status Register 1">
		<bitfield id="GRAB_RAM0" description="Grab RAM LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM2" description="Grab RAM LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM3" description="Grab RAM LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM LS7" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_EXEONLYSECT1R" width="32" page="1" offset="0x26" internal="0" description="Zone 1 Execute Only Flash Status Register 1">
		<bitfield id="EXEONLY_BANK0_SECT0" description="Execute-Only Flash Sector 0 in flash Bank 0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT1" description="Execute-Only Flash Sector 1 in flash Bank 0" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT2" description="Execute-Only Flash Sector 2 in flash Bank 0" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT3" description="Execute-Only Flash Sector 3 in flash Bank 0" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT4" description="Execute-Only Flash Sector 4 in flash Bank 0" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT5" description="Execute-Only Flash Sector 5 in flash Bank 0" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT6" description="Execute-Only Flash Sector 6 in flash Bank 0" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT7" description="Execute-Only Flash Sector 7 in flash Bank 0" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT8" description="Execute-Only Flash Sector 8 in flash Bank 0" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT9" description="Execute-Only Flash Sector 9 in flash Bank 0" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT10" description="Execute-Only Flash Sector 10 in flash Bank 0" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT11" description="Execute-Only Flash Sector 11 in flash Bank 0" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT12" description="Execute-Only Flash Sector 12 in flash Bank 0" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT13" description="Execute-Only Flash Sector 13 in flash Bank 0" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT14" description="Execute-Only Flash Sector 14 in flash Bank 0" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK0_SECT15" description="Execute-Only Flash Sector 15 in flash Bank 0" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT0" description="Execute-Only Flash Sector 0 in flash Bank 1" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT1" description="Execute-Only Flash Sector 1 in flash Bank 1" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT2" description="Execute-Only Flash Sector 2 in flash Bank 1" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT3" description="Execute-Only Flash Sector 3 in flash Bank 1" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT4" description="Execute-Only Flash Sector 4 in flash Bank 1" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT5" description="Execute-Only Flash Sector 5 in flash Bank 1" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT6" description="Execute-Only Flash Sector 6 in flash Bank 1" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT7" description="Execute-Only Flash Sector 7 in flash Bank 1" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT8" description="Execute-Only Flash Sector 8 in flash Bank 1" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT9" description="Execute-Only Flash Sector 9 in flash Bank 1" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT10" description="Execute-Only Flash Sector 10 in flash Bank 1" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT11" description="Execute-Only Flash Sector 11 in flash Bank 1" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT12" description="Execute-Only Flash Sector 12 in flash Bank 1" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT13" description="Execute-Only Flash Sector 13 in flash Bank 1" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT14" description="Execute-Only Flash Sector 14 in flash Bank 1" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK1_SECT15" description="Execute-Only Flash Sector 15 in flash Bank 1" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="Z1_EXEONLYSECT2R" width="32" page="1" offset="0x28" internal="0" description="Zone 1 Execute Only Flash Status Register 2">
		<bitfield id="EXEONLY_BANK2_SECT0" description="Execute-Only Flash Sector 0 in flash BANK 2" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT1" description="Execute-Only Flash Sector 1 in flash BANK 2" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT2" description="Execute-Only Flash Sector 2 in flash BANK 2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT3" description="Execute-Only Flash Sector 3 in flash BANK 2" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT4" description="Execute-Only Flash Sector 4 in flash BANK 2" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT5" description="Execute-Only Flash Sector 5 in flash BANK 2" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT6" description="Execute-Only Flash Sector 6 in flash BANK 2" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT7" description="Execute-Only Flash Sector 7 in flash BANK 2" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT8" description="Execute-Only Flash Sector 8 in flash BANK 2" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT9" description="Execute-Only Flash Sector 9 in flash BANK 2" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT10" description="Execute-Only Flash Sector 10 in flash BANK 2" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT11" description="Execute-Only Flash Sector 11 in flash BANK 2" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT12" description="Execute-Only Flash Sector 12 in flash BANK 2" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT13" description="Execute-Only Flash Sector 13 in flash BANK 2" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT14" description="Execute-Only Flash Sector 14 in flash BANK 2" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_BANK2_SECT15" description="Execute-Only Flash Sector 15 in flash BANK 2" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="Z1_EXEONLYRAM1R" width="32" page="1" offset="0x2a" internal="0" description="Zone 1 Execute Only RAM Status Register 1">
		<bitfield id="EXEONLY_RAM0" description="Execute-Only RAM LS0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM1" description="Execute-Only RAM LS1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM2" description="Execute-Only RAM LS2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM3" description="Execute-Only RAM LS3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM4" description="Execute-Only RAM LS4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM5" description="Execute-Only RAM LS5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM6" description="Execute-Only RAM LS6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM7" description="Execute-Only RAM LS7" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY0" width="32" page="1" offset="0x2e" internal="0" description="JTAG Unlock Key Register 0">
		<bitfield id="KEY0" description="JTAGKEY Bits 31:0" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY1" width="32" page="1" offset="0x30" internal="0" description="JTAG Unlock Key Register 1">
		<bitfield id="KEY1" description="JTAGKEY Bits 63:32" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY2" width="32" page="1" offset="0x32" internal="0" description="JTAG Unlock Key Register 2">
		<bitfield id="KEY2" description="JTAGKEY Bits 95:64" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY3" width="32" page="1" offset="0x34" internal="0" description="JTAG Unlock Key Register 3">
		<bitfield id="KEY3" description="JTAGKEY Bits 127:96" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY0" width="32" page="1" offset="0x36" internal="0" description="Secure Boot CMAC Key Status Register 0">
		<bitfield id="KEY0" description="CMACKEY Bits 31:0" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY1" width="32" page="1" offset="0x38" internal="0" description="Secure Boot CMAC Key Status Register 1">
		<bitfield id="KEY1" description="CMACKEY Bits 63:32" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY2" width="32" page="1" offset="0x3a" internal="0" description="Secure Boot CMAC Key Status Register 2">
		<bitfield id="KEY2" description="CMACKEY Bits 95:64" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY3" width="32" page="1" offset="0x3c" internal="0" description="Secure Boot CMAC Key Status Register 3">
		<bitfield id="KEY3" description="CMACKEY Bits 127:96" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
